papadeltasierra/cloudsmets/esp32/cloudsmets/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF)  Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32c3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_TWO_OTA=y
CONFIG_CS_WEB_LISTEN_PORT=80
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y
